import React from "react";
import styles from "./Privacy_policy.module.css";
import { Link } from "react-router-dom";

export default function PrivacyPolicy() {
  return (
    <>
      <div className={styles.container}>
        <h1 className={styles.title}>Політика конфіденційності</h1>

        <p>
          Останнє оновлення: <b>25.02.2025</b>
        </p>

        <p>
          Ця Політика конфіденційності пояснює, як наш сайт збирає, використовує
          та захищає вашу персональну інформацію.
        </p>

        <ol>
          <li>
            <b>Яку інформацію ми збираємо?</b>
            <div>
              Ми не збираємо жодних персональних даних користувачів, оскільки на
              сайті вiдсутня реєстрація та функція оплати. Проте ми можемо
              автоматично отримувати деякі технічнi данi:
              <ul>
                <li>Файли cookie для покращення роботи сайту;</li>
                <li>
                  Анонімні дані про використання сайту (наприклад, переглянуті
                  сторінки, пристрій, браузер).
                </li>
              </ul>
            </div>
          </li>

          <li>
            <b>Як ми використовуємо інформацію?</b>
            <div>
              Зібрані технічнi данi використовуються виключно для:
              <ul>
                <li>Оптимiзацiї роботи сайту;</li>
                <li>Аналізу відвідуваності та покращення контенту</li>
              </ul>
            </div>
          </li>

          <li>
            <b>Файли cookie</b>
            <div>
              Ми можемо використовувати файли cookie для покращення взаємодії
              користувачів із сайтом. Ви можете вимкнути cookie у налаштуваннях
              свого браузера.
            </div>
          </li>

          <li>
            <b>Посилання на сторонні ресурси</b>
            <div>
              На сайтi можуть бути посилання на сторонні ресурси (наприклад,
              YouTube або інші відеоплатформи). Ми не несемо відповідальності за
              їхні політики конфіденційності.
            </div>
          </li>

          <li>
            <b>Безпека</b>
            <div>
              Ми прагнемо захищати наш сайт від несанкціонованого доступу,
              однак, будь-яка передача даних через інтернет не є повністю
              безпечною.
            </div>
          </li>

          <li>
            <b>Зміни до цієї політики</b>
            <div>
              Ми залишаємо за собою право оновлювати цю Політику
              конфіденційності. Оновлення буде відображено на цій сторінці. Якщо
              у вас є питання щодо конфіденційності, зв’яжіться з нами через{" "}
              <b>
                Email:{" "}
                <a
                  href="mailto:ipz221_foi@student.ztu.edu.ua"
                  className="email"
                >
                  ipz221_foi@student.ztu.edu.ua
                </a>
              </b>
            </div>
          </li>
        </ol>

        <hr />

        <p>
          Цей документ є складовою частиною проєкту і діє відповідно до ліцензії
          MIT, яку можна переглянути за посиланням{" "}
          <Link to="/license" className="license">
            LICENSE
          </Link>
          .
        </p>
      </div>
    </>
  );
}
